Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: Even in the third version, we aren't guaranteed to avoid cycles. Instances of string subclasses are allowed and string subclasses could allow cycles even if normal strings don't.
pl: Nawet w trzeciej wersji, nie dostajemy gwarancji że ominiemy cykle. Przykłady podrzędnych uogólnień względem ciągów znaków są tolerowane i podrzędne uogólnienia względem ciągu znaków mogłyby pozwolić na cykle nawet jeśli normalne ciągi znaków nie są tolerowane.

source: Building C and C++ Extensions on Windows
pl: Budowanie Rozszerzeń C i C++ na Windows

source: This chapter briefly explains how to create a Windows extension module for Python using Microsoft Visual C++, and follows with more detailed background information on how it works. The explanatory material is useful for both the Windows programmer learning to build Python extensions and the Unix programmer interested in producing software which can be successfully built on both Unix and Windows.
pl: Ten rozdział krótko wyjaśnia jak stworzyć moduł rozszerzający dla Windows dla języka pytonowskiego używając Microsoft Visual C++, i dalej wyjaśnia bardziej szczegółowo informacje tła o tym jak on działa. Wyjaśniający materiał jest użyteczny dla zarówno programisty Windows uczącego się budować rozszerzenia języka pytonowskiego i dla programisty Unix zainteresowanego wyprodukowaniem oprogramowania które może być z sukcesem zbudowane zarówno w Unixie jak i Windows.

source: Module authors are encouraged to use the distutils approach for building extension modules, instead of the one described in this section. You will still need the C compiler that was used to build Python; typically Microsoft Visual C++.
pl: Autorzy modułów są zachęcani aby użyć podejścia distutils dla budowania rozszerzających modułów, zamiast tego opisanego w tej sekcji. Wciąż będziesz potrzebował kompilatora C który był użyty do zbudowania języka pytonowskiego; typowo Microsoft Visual C++.

source: This chapter mentions a number of filenames that include an encoded Python version number. These filenames are represented with the version number shown as ``XY``; in practice, ``'X'`` will be the major version number and ``'Y'`` will be the minor version number of the Python release you're working with. For example, if you are using Python 2.2.1, ``XY`` will actually be ``22``.
pl: Ten rozdział wspomina pewną ilość nazw plików które zawierają zakodowany numer wersji języka pytonowskiego. Te nazwy plików są reprezentowane przez numer wersji pokazany jako ``XY``; w praktyce, ``'X'`` będzie numerem wersji głównej zaś ``'Y'`` będzie numerem wersji pobocznym względem wydania języka pytonowskiego z którym pracujesz. Dla przykładu, jeśli używasz języka pytonowskiego 2.2.1, ``XY`` będzie ``22``.

source: A Cookbook Approach
pl: Podejście ksiązki kucharskiej

source: There are two approaches to building extension modules on Windows, just as there are on Unix: use the :mod:`distutils` package to control the build process, or do things manually. The distutils approach works well for most extensions; documentation on using :mod:`distutils` to build and package extension modules is available in :ref:`distutils-index`. This section describes the manual approach to building Python extensions written in C or C++.
pl: Istnieją dwa podejścia do budowania modułów rozszerzających w Windows, tak jak istnieją na Unix-ie: użyj pakietu :mod:`distutils` aby kontrolować proces budowania, lub rób rzeczy ręcznie. Podejście distutils działa dobrze na większości rozszerzeń; dokumentacja, jak używać :mod:`distutils` aby budować rozszerzające pakiety jest dostępna w :ref:`distutils-index`. Ta sekcja opisuje ręczne podejście do budowania rozszerzeń napisanych w C lub C++.

source: To build extensions using these instructions, you need to have a copy of the Python sources of the same version as your installed Python. You will need Microsoft Visual C++ "Developer Studio"; project files are supplied for VC++ version 7.1, but you can use older versions of VC++. Notice that you should use the same version of VC++that was used to build Python itself. The example files described here are distributed with the Python sources in the :file:`PC\\example_nt\\` directory.
pl: Aby zbudować rozszerzenia używając tych instrukcji, potrzebujesz mieć kopię języka pytonowskiego tej samej wersji jak twój zainstalowany język pytonowski. Będziesz potrzebował Microsoft Visual C++ "Developer Studio"; pliki projektu są dostarczone dla wersji VC++ 7.1, ale możesz używać starszej wersji VC++. Zauważ że powinieneś używać tej samej wersji VC++ która była użyta aby zbudować język pytonowski sam w sobie. Przykładowe pliki opisane tutaj są dystrybuowane ze źródłowymi plikami języka pytonowskiego w katalogu :file:`PC\example_nt\`

source: **Copy the example files** --- The :file:`example_nt` directory is a subdirectory of the :file:`PC` directory, in order to keep all the PC-specific files under the same directory in the source distribution. However, the :file:`example_nt` directory can't actually be used from this location. You first need to copy or move it up one level, so that :file:`example_nt` is a sibling of the :file:`PC` and :file:`Include` directories. Do all your work from within this new location.
pl: **Skopiuj przykłady plików** --- Katalog :file:`example_nt` jest podkatalogiem katalogu :file:`PC`, w celu utrzymania wszystkich szczególnych dla PC-ta plików w tym samym katalogu w źródłowej dystrybucji. Jednakże, katalog :file:`example_nt` nie może być użyty z tej lokacji. Najpierw potrzebujesz skopiować lub przenieść go o jeden poziom wyżej, tak że :file:`example_nt` jest siostrzane względem katalogu :file:`PC` i katalogu :file:`include`. Wykonuj całą swoją pracę z wnętrza tej nowej lokalizacji.

source: **Open the project** --- From VC++, use the :menuselection:`File --> Open Solution` dialog (not :menuselection:`File --> Open`!). Navigate to and select the file :file:`example.sln`, in the *copy* of the :file:`example_nt` directory you made above. Click Open.
pl: **Otwórz projekt** --- Z VC++, użyj :menuselection:`File --> Open Solution` - z ang. - :menuselection:`Plik --> Otwórz rozwiązanie` (nie :menuselection:`File --> Open`!). Przejdź i wybierz plik :file:`example.sln`, w *kopii* katalogu :file:`example_nt` którą uczyniłeś powyżej. Kliknij Otwórz.

source: **Build the example DLL** --- In order to check that everything is set up right, try building:
pl: **Zbuduj przykładowy DLL** --- W celu sprawdzenia czy wszystko jest ustawione właściwie, spróbuj zbudować:

source: Select a configuration. This step is optional. Choose :menuselection:`Build --> Configuration Manager --> Active Solution Configuration` and select either :guilabel:`Release` or :guilabel:`Debug`. If you skip this step, VC++ will use the Debug configuration by default.
pl: Wybierz konfigurację. Ten krok jest opcjonalny. Wybierz :menuselection:`Build --> Configuration Manager --> Active Solution Configuration` z ang. - :menuselection:`Buduj --> Zarządca Konfiguracji-->Konfiguracja Aktywnego Rozwiązania` i wybierz albo :guilabel:`Release` albo :guilabel:`Debug`. Jeśli pominiesz ten krok, VC++ będzie używało konfiguracji Debug domyślnie.

source: Build the DLL. Choose :menuselection:`Build --> Build Solution`. This creates all intermediate and result files in a subdirectory called either :file:`Debug` or :file:`Release`, depending on which configuration you selected in the preceding step.
pl: Zbuduj DLL. Wybierz :menuselection:`Buduj --> Buduj Rozwiązanie`. To tworzy wszystkie pośrednie i wynikowe pliki w podkatalogu nazwanym albo :file:`Debug` albo :file:`Release`, w zależności od tego, którą konfiguracje wybrałeś w poprzednim kroku.

source: **Testing the debug-mode DLL** --- Once the Debug build has succeeded, bring up a DOS box, and change to the :file:`example_nt\\Debug` directory. You should now be able to repeat the following session (``C>`` is the DOS prompt, ``>>>`` is the Python prompt; note that build information and various debug output from Python may not match this screen dump exactly)::
pl: **Testowanie w trybie-debug DLL** --- Gdy budowanie Debug powiodło się, wywołaj okno DOS'a i zmień katalog na :file:`example_nt\Debug`. Powinieneś teraz być w stanie powtórzyć następującą sesję (``C>`` jest zachętą DOS'a, ``>>>`` jest zachętą języka pytonowskiego; zauważ, że informacja o budowaniu i rożne treści wychodzące przy debugowaniu z języka pytonowskiego mogą nie pasować do tego zrzutu ekranu dokładnie)::

source: Congratulations! You've successfully built your first Python extension module.
pl: Gratulacje! z powodzeniem zbudowałeś swój pierwszy moduł rozszerzający języka pytonowskiego.

source: **Creating your own project** --- Choose a name and create a directory for it. Copy your C sources into it. Note that the module source file name does not necessarily have to match the module name, but the name of the initialization function should match the module name --- you can only import a module :mod:`spam` if its initialization function is called :cfunc:`initspam`, and it should call :cfunc:`Py_InitModule` with the string ``"spam"`` as its first argument (use the minimal :file:`example.c` in this directory as a guide). By convention, it lives in a file called :file:`spam.c` or :file:`spammodule.c`. The output file should be called :file:`spam.pyd` (in Release mode) or :file:`spam_d.pyd` (in Debug mode). The extension :file:`.pyd` was chosen to avoid confusion with a system library :file:`spam.dll` to which your module could be a Python interface.
pl: **Tworzenie twojego własnego projektu** --- Wybierz nazwę i utwórz katalog dla niej. Przekopiuj pliki źródłowe C do niego. Zauważ, że nazwa pliku źródłowego modułu nie koniecznie musi odpowiadać nazwie modułu, ale nazwa zadania inicjującego powinna odpowiadać nazwie modułu --- możesz tylko importować moduł :mod:`spam` jeśli jego zadanie inicjujące jest nazwane :cfunc:`initspam`, i powinno wywołać :cfunc:`PyInitModule` z ciągiem znaków ``"spam"`` jako pierwszym parametrem (użyj minimalnego pliku :file:`example.c` w tym katalogu jako przewodnika). Przez konwencję, on przebywa w pliku nazywanym :file:`spam.c` lub :file:`spammodule.c`. Plik wyjściowy powinien być nazwany :file:`spam.pyd` (w trybie Wydania - z ang. - Release) lub :file:`spam_d.pyd` (w trybie Debugowania). Rozszerzenie :file:`.pyd` zostało wybrane aby uniknąć pomyłek z systemową biblioteką :file:`spam.dll` do której twój moduł mógłby być sprzęgiem języka Pytonowskiego.

source: Now your options are:
pl: Teraz twoje opcje są następujące:

source: :file:`spam.\*`, and edit them by hand, or
pl: :file:`spam.\*`, do zmian ręcznych, lub

source: Create a brand new project; instructions are below.
pl: Utwórz zupełnie nowy projekt; instrukcje są poniżej.

source: In either case, copy :file:`example_nt\\example.def` to :file:`spam\\spam.def`, and edit the new :file:`spam.def` so its second line contains the string '``initspam``'. If you created a new project yourself, add the file :file:`spam.def` to the project now. (This is an annoying little file with only two lines. An alternative approach is to forget about the :file:`.def` file, and add the option :option:`/export:initspam` somewhere to the Link settings, by manually editing the setting in Project Properties dialog).
pl: W każdym razie, skopiuj plik :file:`example_nt\example.def` do :file:`spam\spam.def`, i zmień nowy plik :file:`spam.def` tak aby jego druga linia zawierała ciąg '``initspam``'. Jeśli utworzyłeś nowy projekt własnoręcznie, dodaj plik :file:`spam.def` do projektu teraz. (To jest ten denerwujący mały plik tylko z dwiema liniami. Alternatywnym podejściem jest zapomnieć o pliku :file:`.def`, i dodać opcję :option:`/export:initspam` gdzieś w ustawieniach łączenia (z ang. - Link Settings) ręcznie zmieniając ustawienia w dialogowym okienku właściwości projektu).

source: **Creating a brand new project** --- Use the :menuselection:`File --> New --> Project` dialog to create a new Project Workspace. Select :guilabel:`Visual C++ Projects/Win32/ Win32 Project`, enter the name (``spam``), and make sure the Location is set to parent of the :file:`spam` directory you have created (which should be a direct subdirectory of the Python build tree, a sibling of :file:`Include` and :file:`PC`). Select Win32 as the platform (in my version, this is the only choice). Make sure the Create new workspace radio button is selected. Click OK.
pl: **Tworzenie zupełnie nowego projektu** --- Użyj okna dialogowego :menuselection:`File --> New --> Project` - z ang. - :menuselection:`Plik --> Nowy --> Projekt` aby stworzyć nową przestrzeń pracy Projektu. Wybierz :guilabel:`Visual C++ Projects/Win32/Win32 Project`, wpisz nazwę (``spam``) i upewnij się że lokacja jest ustawiona na katalog nadrzędny względem katalogu :file:`spam` który utworzyłeś (który powinien być bezpośrednim podkatalogiem drzewa budowania języka pytonowskiego, siostrzanym względem :file:`Include` i :file:`PC`). Wybierz Win32 jako maszynę/środowisko (w mojej wersji, to jest jedyny wybór). Upewnij się że opcja "Stwórz nową przestrzeń pracy" jest wybrana. Kliknij OK.

source: You should now create the file :file:`spam.def` as instructed in the previous section. Add the source files to the project, using :menuselection:`Project --> Add Existing Item`. Set the pattern to ``*.*`` and select both :file:`spam.c` and :file:`spam.def` and click OK. (Inserting them one by one is fine too.)
pl: Powinieneś teraz utworzyć plik :file:`spam.def` jak powiedziano w poprzednim rozdziale. Dodaj pliki źródłowe do projektu, używając :menuselection:`Project --> Add Existing Item` z ang. - :menuselection:`Projekt --> Dodaj Istniejący Element`. Ustaw wzorzec na ``*.*`` i wybierz zarówno :file:`spam.c` i :file:`spam.def` i naciśnij OK. (Wstawianie ich jeden po drugim też jest w porządku.)

source: Now open the :menuselection:`Project --> spam properties` dialog. You only need to change a few settings. Make sure :guilabel:`All Configurations` is selected from the :guilabel:`Settings for:` dropdown list. Select the C/C++ tab. Choose the General category in the popup menu at the top. Type the following text in the entry box labeled :guilabel:`Additional Include Directories`::
pl: Teraz otwórz okno dialogowe :menuselection:`Project --> spam properties` - z ang. - :menuselection:`Projekt --> właściwości spam`. Potrzebujesz zmienić tylko kilka opcji. Upewnij się, że :guilabel:`Wszystkie konfiguracje` jest zaznaczony z listy rozwijalnej :guilabel:`Ustawienia dla:`. Wybierz zakładkę C/C++. Wybierz kategorię Ogólną w menu spod prawego przycisku na górze. Wpisz następujący tekst w polu wprowadzania oznaczonym :guilabel:`Dodatkowe Katalogi Załączania` -z ang. - :guilabel:`Additional Include Directories`::

source: Then, choose the General category in the Linker tab, and enter ::
pl: Następnie, wybierz kategorię ogólną w zakładce załączania, i wpisz ::

source: in the text box labelled :guilabel:`Additional library Directories`.
pl: w polu tekstowym oznaczonym :guilabel:`Dodatkowe katalogi biblioteczne`.

source: Now you need to add some mode-specific settings:
pl: Teraz potrzebujesz dodać pewne ustawienia szczególne dla trybu-pracy:

source: Select :guilabel:`Release` in the :guilabel:`Configuration` dropdown list. Choose the :guilabel:`Link` tab, choose the :guilabel:`Input` category, and append ``pythonXY.lib`` to the list in the :guilabel:`Additional Dependencies` box.
pl: Wybierz :guilabel:`Release` - z ang. - :guilabel:`Wydanie` w liście rozwijalnej :guilabel:`Configuration` - z ang. - :guilabel:`Konfiguracja`. Wybierz zakładkę :guilabel:`Link` - z ang. - :guilabel:`Połączenia`, wybierz kategorię :guilabel:`Input` - z ang. - :guilabel:`Wprowadzanie`, i dodaj ``pythonXY.lib`` do listy w polu :guilabel:`Dodatkowe Zależności` - z ang. - :guilabel:`Additional Dependencies`.

source: Select :guilabel:`Debug` in the :guilabel:`Configuration` dropdown list, and append ``pythonXY_d.lib`` to the list in the :guilabel:`Additional Dependencies` box. Then click the C/C++ tab, select :guilabel:`Code Generation`, and select :guilabel:`Multi-threaded Debug DLL` from the :guilabel:`Runtime library` dropdown list.
pl: Wybierz :guilabel:`Debug` z listy rozwijalnej :guilabel:`Konfiguracja` i dodaj ``pythonXY_d.lib`` do listy w polu :guilabel:`Dodatkowe Zależności`. Potem kliknij zakładkę C/C++, wybierz :guilabel:`Generacja Kodu`, i wybierz :guilabel:`Wielo-wątkowa biblioteka DLL Debugowania` z listy rozwijalnej :guilabel:`biblioteka czasu wykonania`.

source: Select :guilabel:`Release` again from the :guilabel:`Configuration` dropdown list. Select :guilabel:`Multi-threaded DLL` from the :guilabel:`Runtime library` dropdown list.
pl: Wybierz :guilabel:`Release` jeszcze raz z listy rozwijalnej :guilabel:`Konfiguracji`. Wybierz :guilabel:`Wielo-wątkowa biblioteka DLL` z listy rozwijalnej :guilabel:`Biblioteki czasu wykonania`.

source: If your module creates a new type, you may have trouble with this line::
pl: Jeśli twój moduł tworzy nowy typ, możesz mieć problemy z tą linijką::

source: Change it to::
pl: Zamień ją na::

source: and add the following to the module initialization function::
pl: i dodaj następujące do zadania zainicjowania modułu::

source: Refer to section 3 of the `Python FAQ <http://www.python.org/doc/faq>`_ for details on why you must do this.
pl: Odwołaj się do rozdziału 3 `FAQ (z ang. - często zadawane pytania) języka pytonowskiego <http://www.python.org/doc/faq>`_ po szczegóły na temat tego, dlaczego musisz to robić.

source: Differences Between Unix and Windows
pl: Różnice pomiędzy Unix-em i Windows-em

source: Unix and Windows use completely different paradigms for run-time loading of code. Before you try to build a module that can be dynamically loaded, be aware of how your system works.
pl: Unix i Windows używają kompletnie różnych zwyczajów dla ładowania kodu w czasie wykonania. Zanim spróbujesz zbudować moduł który może być dynamicznie załadowany, przypomnij sobie jak działa twój system.

source: In Unix, a shared object (:file:`.so`) file contains code to be used by the program, and also the names of functions and data that it expects to find in the program. When the file is joined to the program, all references to those functions and data in the file's code are changed to point to the actual locations in the program where the functions and data are placed in memory. This is basically a link operation.
pl: W Unix-ie, pliki współdzielonych przedmiotów (:file:`.so`) zawierają kod do użycia przez program, a także nazwy zadań i danych których spodziewa się znaleźć w programie. Gdy plik jest łączony z programem, wszystkie odniesienia do tych zadań i danych w kodzie pliku są zmieniane aby wskazywać na konkretne położenia w programie gdzie zadania i dane są umieszczane w pamięci. To jest właściwie operacja połączenia.

source: In Windows, a dynamic-link library (:file:`.dll`) file has no dangling references. Instead, an access to functions or data goes through a lookup table. So the DLL code does not have to be fixed up at runtime to refer to the program's memory; instead, the code already uses the DLL's lookup table, and the lookup table is modified at runtime to point to the functions and data.
pl: W Windows, plik dynamicznie-łączonej biblioteki (:file:`.dll`) nie ma żadnych wiszących odniesień. Zamiast tego, dostęp do zadań lub danych przechodzi przez tablicę podglądania. Więc kod DLL nie musi być naprawiany w czasie wykonania aby odnosić się do pamięci programu; zamiast tego, kod już używa tablicy podglądania DLL, i tablica podglądania jest zmieniana w czasie wykonania aby wskazywać na zadania i dane.

source: In Unix, there is only one type of library file (:file:`.a`) which contains code from several object files (:file:`.o`). During the link step to create a shared object file (:file:`.so`), the linker may find that it doesn't know where an identifier is defined. The linker will look for it in the object files in the libraries; if it finds it, it will include all the code from that object file.
pl: W Unix-ie, istnieje tylko jeden typ pliku biblioteki (:file:`.a`), który zawiera kod z kilku plików przedmiotów (:file:`.o`). W czasie kroku łączenia aby utworzyć współdzielony plik przedmiotu (:file:`.so`), program łączący może stwierdzić że nie wie gdzie jest zdefiniowany identyfikator. Program łączący poszuka go w plikach przedmiotów w bibliotekach; jeśli go znajdzie, załączy cały kod z takiego pliku przedmiotu.

source: In Windows, there are two types of library, a static library and an import library (both called :file:`.lib`). A static library is like a Unix :file:`.a` file; it contains code to be included as necessary. An import library is basically used only to reassure the linker that a certain identifier is legal, and will be present in the program when the DLL is loaded. So the linker uses the information from the import library to build the lookup table for using identifiers that are not included in the DLL. When an application or a DLL is linked, an import library may be generated, which will need to be used for all future DLLs that depend on the symbols in the application or DLL.
pl: W Windows, istnieją dwa typy bibliotek, statyczna biblioteka i biblioteka importu (obie zwane :file:`.lib`). Statyczna biblioteka jest jak Unix-owy plik :file:`.a`; zawiera kod do załączenia gdy potrzeba. Biblioteka importu jest w zasadzie używana tylko aby zapewnić program łączący, że dany identyfikator jest legalny, i będzie obecny w programie gdy DLL jest ładowany. Więc program łączący używa informacji z biblioteki importu aby zbudować tabelę podglądania dla użycia identyfikatorów, które nie są załączone w pliku DLL. Gdy aplikacja lub DLL jest łączony biblioteka importu może być wygenerowana, która może być potrzebna do użycia dla wszystkich przyszłych plików DLL, które zależą od symboli w aplikacji lub pliku DLL.

source: Suppose you are building two dynamic-load modules, B and C, which should share another block of code A. On Unix, you would *not* pass :file:`A.a` to the linker for :file:`B.so` and :file:`C.so`; that would cause it to be included twice, so that B and C would each have their own copy. In Windows, building :file:`A.dll` will also build :file:`A.lib`. You *do* pass :file:`A.lib` to the linker for B and C. :file:`A.lib` does not contain code; it just contains information which will be used at runtime to access A's code.
pl: Załóżmy że budujesz dwa dynamicznie-ładowane moduły, B i C, które powinny współdzielić inny blok kodu A. W Unix-ie *nie* podałbyś pliku :file:`A.a` dla programu łączącego dla pliku `B.so` i pliku :file:`C.so`; to mogłoby spowodować że będzie on załączony dwukrotnie, więc B i C miałyby mieć każdy swoją własną kopię. W Windows, zbudowanie pliku :file:`A.dll` zbuduje także :file:`A.lib`. Przekazujesz plik :file:`A.lib` dla programu łączącego B i C. Plik :file:`A.lib` nie zawiera kodu; zawiera tylko informacje, które będą użyte w czasie wykonania aby uzyskać dostęp do kodu A.

source: In Windows, using an import library is sort of like using ``import spam``; it gives you access to spam's names, but does not create a separate copy. On Unix, linking with a library is more like ``from spam import *``; it does create a separate copy.
pl: W Windows, używanie bibliotek importu jest trochę jak używanie ``import spam``; daje Ci dostęp do nazw spamu, ale nie tworzy oddzielnej kopii. Na Unix-ie, połączenie z biblioteką jest bardziej jak ``from spam import *``; tworzy oddzielną kopię.

source: Using DLLs in Practice
pl: Używanie DLLów w praktyce
